openshift_arch_oper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-20 周四 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Architecting and Operating OpenShift Cluster</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="龔存" />
</head>
<body>
<div id="content">
<h1 class="title">Architecting and Operating OpenShift Cluster</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb481668">1. Networking</a>
<ul>
<li><a href="#orgf6b5d6f">1.1. East-West Traffic</a></li>
<li><a href="#orgdbf4693">1.2. North-South Traffic</a></li>
</ul>
</li>
<li><a href="#org9a4bdac">2. Build &amp; deploy docker image</a>
<ul>
<li><a href="#org9b5328d">2.1. Setup the proxy</a></li>
<li><a href="#org7bce0c3">2.2. Create docker image</a></li>
<li><a href="#orgc039f6d">2.3. Delete container &amp; images</a></li>
<li><a href="#org2c9f3aa">2.4. Push docker images to OpenShift internal registry</a></li>
</ul>
</li>
<li><a href="#org92bbc89">3. Re-deploy the application</a></li>
<li><a href="#org388d569">4. Getting traffic into a cluster</a>
<ul>
<li><a href="#org51b6366">4.1. Allow user with cluster admin role</a></li>
<li><a href="#orgd4c2bf9">4.2. Defining the public IP range</a></li>
<li><a href="#orgb7a8143">4.3. Create a Project and Service</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb481668" class="outline-2">
<h2 id="orgb481668"><span class="section-number-2">1</span> Networking</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf6b5d6f" class="outline-3">
<h3 id="orgf6b5d6f"><span class="section-number-3">1.1</span> East-West Traffic</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In the default configuration, the cluster network is the <b>10.128.0.0/14</b>
network, and node allocated <b>/23</b> subnets (i.e., <b>10.128.0.0/23</b>,
<b>10.128.2.0/23</b>, <b>10.128.4.0/23</b>, and so on). This means that the cluster
network has 512 subnets available to assign to nodes, and a given node is
allocated 510 addresses that it can assign to the containers running on it. The
size and address range of the cluster network are configurable, as is the host
subnet size. 
</p>

<pre class="example">
[root@master ~]# view /etc/origin/master/master-config.yaml
networkConfig:
  clusterNetworks:
  - cidr: 10.128.0.0/14
    hostSubnetLength: 9
  externalIPNetworkCIDRs:
  - 0.0.0.0/0
  networkPluginName: redhat/openshift-ovs-subnet
  serviceNetworkCIDR: 172.30.0.0/16

[root@master ~]# oc get hostsubnet -o wide
NAME                     HOST                     HOST IP         SUBNET          EGRESS CIDRS   EGRESS IPS
infra.myopenshift.com    infra.myopenshift.com    192.168.23.52   10.130.0.0/23   []             []
master.myopenshift.com   master.myopenshift.com   192.168.23.31   10.128.0.0/23   []             []
node.myopenshift.com     node.myopenshift.com     192.168.23.51   10.129.0.0/23   []             []
</pre>

<p>
OpenShift SDN creates and configures three network devices:
</p>

<dl class="org-dl">
<dt>br0</dt><dd>the OVS bridge device that pod containers will be attached to.
OpenShift SDN also configures a set of non-subnet-specific flow rules
on this bridge.</dd>
<dt>tun0</dt><dd>an OVS internal port (port 2 on <b>br0</b>). This gets assigned the cluster
subnet gateway address, and is used for external network access.
OpenShift SDN configures <b>netfilter</b> and routing rules to enable access
from the cluster subnet to the external network via NAT.</dd>
<dt>vxlan_sys_4789</dt><dd>The OVS VXLAN device (port 1 on <b>br0</b>), which provides access
to containers on remote nodes. Referred to as <b>vxlan0</b> in the
OVS rules.</dd>
</dl>

<p>
For each Pod in the Node, the local OpenShift creates a <i>vethXX</i> interface and
assign it to the OVS br0. The <i>vxlan_sys_4789</i> of <i>br0</i> is the interface that
defines the <i>VXLAN</i> tunnels, or the overlay network, that enables the
communication between local Pods with Pods in remote Nodes. This interface is
known as <i>vxlan0</i> interface inside the OVS and that is the name used in the
OpenFlow entries. The <i>tun0</i> interface gets the local cluster network subnet
gateway address. This is the interface that provide <i>NAT</i> access from the
cluster network subnet to the external network. In additional to the local
cluster network subnet gateway address, on each <i>Node</i> the Kubernetes Service
objects network is also pointed to the <i>tun0</i> interface.
</p>

<pre class="example">
[root@node ~]# ip route
...
10.128.0.0/14 dev tun0 scope link
...
172.30.0.0/16 dev tun0

[root@node ~]# ifconfig tun0
tun0: flags=4163&lt;UP,BROADCAST,RUNNING,MULTICAST&gt;  mtu 1450
        inet 10.129.0.1  netmask 255.255.254.0  broadcast 10.129.1.255
        ...

[root@node ~]# iptables -v -t nat -L OPENSHIFT-MASQUERADE
Chain OPENSHIFT-MASQUERADE (1 references)
 pkts bytes target     prot opt in     out     source               destination
    0     0 RETURN     all  --  any    any     anywhere             anywhere             mark match 0x1/0x1
    7   621 MASQUERADE  all  --  any    any     10.128.0.0/14        anywhere             /* masquerade pod-to-service and pod-to-external traffic */

</pre>
<p>
The Pod ip will be NAT to the IP of the physical interface when it access the
external host.
</p>
</div>
</div>
<div id="outline-container-orgdbf4693" class="outline-3">
<h3 id="orgdbf4693"><span class="section-number-3">1.2</span> North-South Traffic</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
[root@master ~]# oc get all --selector='router=router' -n default -o wide
NAME                 READY     STATUS    RESTARTS   AGE       IP              NODE                    NOMINATED NODE
pod/router-2-ssfwc   1/1       Running   0          17h       192.168.23.52   infra.myopenshift.com   &lt;none&gt;

NAME                             DESIRED   CURRENT   READY     AGE       CONTAINERS   IMAGES                                                       SELECTOR
replicationcontroller/router-1   0         0         0         18h       router       registry.redhat.io/openshift3/ose-haproxy-router:v3.11       deployment=router-1,deploymentconfig=router,router=router
replicationcontroller/router-2   1         1         1         17h       router       registry.redhat.io/openshift3/ose-haproxy-router:v3.11.157   deployment=router-2,deploymentconfig=router,router=router

NAME             TYPE        CLUSTER-IP       EXTERNAL-IP   PORT(S)                   AGE       SELECTOR
service/router   ClusterIP   172.30.169.119   &lt;none&gt;        80/TCP,443/TCP,1936/TCP   18h       router=router

NAME                                        REVISION   DESIRED   CURRENT   TRIGGERED BY
deploymentconfig.apps.openshift.io/router   2          1         1         config

</pre>

<p>
The default OpenShift Router is one or more Router Pods running on
Infrastructure Nodes (<code>infra.myopenshift.com</code>) and is deployed as a <i>Deployment
Config</i> (<code>deploymentconfig.apps.ose.I/O/router</code>).
</p>

<p>
These Routers container images are based on <i>HAProxy</i> (see <code>IMAGES</code>). These
<i>Pods</i> are defined to share the <i>Network Namespace</i> with the host
<i>Infrastructure Node</i>:
</p>
<pre class="example">
[root@master ~]# oc api-resources
[root@master ~]# oc get dc
[root@master ~]# oc get services
[root@master ~]# oc get pods
[root@master ~]# oc get routes
[root@master ~]# oc get routes &lt;route-name&gt; -o yaml
[root@master ~]# oc get dc router -o yaml
[root@master ~]# oc get services router -o yaml
[root@master ~]# oc get services &lt;service-name&gt; -o yaml
[root@master ~]# oc get pods &lt;pod-name&gt; -o yaml


</pre>

<p>
Sharing the <i>Network Namespace</i> enables these <i>Router Pods</i> to receive traffic
over the <i>host-network</i>. By default, the <i>OpenShift Router</i> listens on TCP ports
80 (HTTP), 443 (HTTPS), and 1936 (HAProxy Stats). Once the traffic arrives to
the Pod, it will match the corresponding Route object.
</p>
</div>
</div>
</div>
<div id="outline-container-org9a4bdac" class="outline-2">
<h2 id="org9a4bdac"><span class="section-number-2">2</span> Build &amp; deploy docker image</h2>
<div class="outline-text-2" id="text-2">
</div>
