openshift_arch_oper.org
** Setup the proxy
#+BEGIN_SRC sh
  oc describe svc/docker-registry -n default
  ...
  Type:              ClusterIP
  IP:                172.30.151.16

  cat ~/.docker/config.json
  ...
  "proxies": {
      "default": {
          "httpProxy": "http://proxy.myopenshift.com:8888",
          "httpsProxy": "http://proxy.myopenshift.com:8888",
          "noProxy": "*.bocmo.com,.bocmacau.com,.myopenshift.com,172.30.151.16"
      }
  }

  systemctl daemon-reload
  systemctl restart docker

  docker login registry.redhat.io
  Username:
  Password:
  Login Succeeded

  docker pull registry.redhat.io/rhel7
  docker images
  registry.redhat.io/rhel7 

  # Get the image path
  docker info
  ...
  Docker Root Dir: /var/lib/docker

  ...

#+END_SRC

** Create docker image
   #+begin_src sh
     mkdir -p /opt/docker/test
     cd /opt/docker/test

     vi Dockerfile
     # This Dockerfile uses the rhel7 image
     # Ahthor: Cun Gong
     FROM rhel7:latest
     RUN yum install -y nc
     CMD /bin/sh

     docker build -t rhel7:v1 .
     docker ps # get the container-id
     docker run --rm -it <container-id> sh
     sh-4.2# type nc

     ## Web test by ncat
     cd /opt/docker/test
     git init
     git add ./Dockerfile
     git commit -m"rhel7:v1"

     cat Dockerfile
     # This Dockerfile uses the rhel7 image
     # Ahthor: Cun Gong
     FROM rhel7:v1
     COPY ./index.http /index.http
     COPY ./ncat-web.sh /ncat-web.sh
     RUN chmod 755 ncat-web.sh
     EXPOSE 8080
     ENTRYPOINT ["/ncat-web.sh"]

     # Build
     docker build -t rhel7:v2 .

     # Server terminal
     docker run -it --rm -P rhel7:v2
     # Client terminal
     docker ps
     ... rhel7:v2 ... 0.0.0.0:32769->8080/tcp
     curl -v -k localhost:32769

   #+end_src

** Delete container & images
#+BEGIN_SRC sh
  # Delete containers
  docker ps --all | grep rhel
  docker container kill <id>
  docker rm -v <id> <id> ...

  # Delete images
  docker images
  docker rmi rhel7:v2
#+END_SRC

** Push docker images to OpenShift internal registry
#+BEGIN_SRC sh
  oc login -u system:admin -n default

  oc describe svc/docker-registry -n default
  Type:              ClusterIP
  IP:                172.30.151.202
  Port:              5000-tcp  5000/TCP
  TargetPort:        5000/TCP

  oc adm policy add-scc-to-user anyuid -z default
  scc "anyuid" added to: ["system:serviceaccount:hello:default"]

  # check permission (no use)
  oc edit scc anyuid

  # Just for debug (no use)
  #oc adm policy add-role-to-user edit system
  #oc adm policy remove-role-from-user edit system

  ## Re-setup the docker proxy
  # Retrieve the registry service’s IP address
  oc describe svc/docker-registry -n default
  vi /etc/sysconfig/docker
  NO_PROXY=...,${docker-registry.default.svc}

  systemctl restart docker

  oc login -u system -p admin
  oc new-project hello
  docker tag rhel7:v2 172.30.151.202:5000/hello/rhel7:v2
  docker login -p `oc whoami -t` -u system 172.30.151.202:5000
  docker push 172.30.151.202:5000/hello/rhel7:v2

  oc new-app hello/rhel7:v2 --name=myapp

  oc expose svc/myapp
  oc get svc/myapp -o wide

  oc get routes
  myapp-hello.apps.myopenshift.com

  curl -v -k myapp-hello.apps.myopenshift.com
#+END_SRC

