openshift_arch_oper.html
<div id="outline-container-org9b5328d" class="outline-3">
<h3 id="org9b5328d"><span class="section-number-3">2.1</span> Setup the proxy</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">oc describe svc/docker-registry -n default
...
Type:              ClusterIP
IP:                <span style="color: #a45bad;">172.30.151.16</span>

cat ~/.docker/config.json
...
<span style="color: #2d9574;">"proxies"</span>: <span style="color: #4f97d7;">{</span>
    <span style="color: #2d9574;">"default"</span>: <span style="color: #bc6ec5;">{</span>
        <span style="color: #2d9574;">"httpProxy"</span>: <span style="color: #2d9574;">"http://proxy.myopenshift.com:8888"</span>,
        <span style="color: #2d9574;">"httpsProxy"</span>: <span style="color: #2d9574;">"http://proxy.myopenshift.com:8888"</span>,
        <span style="color: #2d9574;">"noProxy"</span>: <span style="color: #2d9574;">"*.bocmo.com,.bocmacau.com,.myopenshift.com,172.30.151.16"</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

systemctl daemon-reload
systemctl restart docker

docker login registry.redhat.io
Username:
Password:
Login Succeeded

docker pull registry.redhat.io/rhel7
docker images
registry.redhat.io/rhel7 

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Get the image path</span>
docker info
...
Docker Root Dir: /var/lib/docker

...

</pre>
</div>
</div>
</div>

<div id="outline-container-org7bce0c3" class="outline-3">
<h3 id="org7bce0c3"><span class="section-number-3">2.2</span> Create docker image</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">mkdir -p /opt/docker/test
<span style="color: #4f97d7;">cd</span> /opt/docker/test

vi Dockerfile
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">This Dockerfile uses the rhel7 image</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Ahthor: Cun Gong</span>
FROM rhel7:latest
RUN yum install -y nc
CMD /bin/sh

docker build -t rhel7:v1 .
docker ps <span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">get the container-id</span>
docker run --rm -it &lt;container-id&gt; sh
sh-4.2# type nc

<span style="color: #ffd700; background-color: nil;">## </span><span style="color: #ffd700; background-color: nil;">Web test by ncat</span>
<span style="color: #4f97d7;">cd</span> /opt/docker/test
git init
git add ./Dockerfile
git commit -m<span style="color: #2d9574;">"rhel7:v1"</span>

cat Dockerfile
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">This Dockerfile uses the rhel7 image</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Ahthor: Cun Gong</span>
FROM rhel7:v1
COPY ./index.http /index.http
COPY ./ncat-web.sh /ncat-web.sh
RUN chmod <span style="color: #a45bad;">755</span> ncat-web.sh
EXPOSE <span style="color: #a45bad;">8080</span>
ENTRYPOINT <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"/ncat-web.sh"</span><span style="color: #4f97d7;">]</span>

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Build</span>
docker build -t rhel7:v2 .

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Server terminal</span>
docker run -it --rm -P rhel7:v2
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Client terminal</span>
docker ps
... rhel7:v2 ... <span style="color: #a45bad;">0.0.0.0:32769-</span>&gt;<span style="color: #a45bad;">8080/tcp</span>
curl -v -k localhost:32769

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc039f6d" class="outline-3">
<h3 id="orgc039f6d"><span class="section-number-3">2.3</span> Delete container &amp; images</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Delete containers</span>
docker ps --all | grep rhel
docker container kill &lt;id&gt;
docker rm -v &lt;id&gt; &lt;id&gt; ...

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Delete images</span>
docker images
docker rmi rhel7:v2
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c9f3aa" class="outline-3">
<h3 id="org2c9f3aa"><span class="section-number-3">2.4</span> Push docker images to OpenShift internal registry</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh">oc login -u system:admin -n default

oc describe svc/docker-registry -n default
Type:              ClusterIP
IP:                <span style="color: #a45bad;">172.30.151.202</span>
Port:              <span style="color: #a45bad;">5000-tcp</span>  <span style="color: #a45bad;">5000/TCP</span>
TargetPort:        <span style="color: #a45bad;">5000/TCP</span>

oc adm policy add-scc-to-user anyuid -z default
scc <span style="color: #2d9574;">"anyuid"</span> added to: <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"system:serviceaccount:hello:default"</span><span style="color: #4f97d7;">]</span>

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">check permission (no use)</span>
oc edit scc anyuid

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Just for debug (no use)</span>
<span style="color: #ffd700; background-color: nil;">#</span><span style="color: #ffd700; background-color: nil;">oc adm policy add-role-to-user edit system</span>
<span style="color: #ffd700; background-color: nil;">#</span><span style="color: #ffd700; background-color: nil;">oc adm policy remove-role-from-user edit system</span>

<span style="color: #ffd700; background-color: nil;">## </span><span style="color: #ffd700; background-color: nil;">Re-setup the docker proxy</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Retrieve the registry service&#8217;s IP address</span>
oc describe svc/docker-registry -n default
vi /etc/sysconfig/docker
<span style="color: #7590db;">NO_PROXY</span>=...,$<span style="color: #4f97d7;">{</span><span style="color: #7590db;">docker</span>-registry.default.svc<span style="color: #4f97d7;">}</span>

systemctl restart docker

oc login -u system -p admin
oc new-project hello
docker tag rhel7:v2 <span style="color: #a45bad;">172.30.151.202:5000/hello/rhel7:v2</span>
docker login -p <span style="color: #fa8072;">`oc whoami -t`</span> -u system <span style="color: #a45bad;">172.30.151.202:5000</span>
docker push <span style="color: #a45bad;">172.30.151.202:5000/hello/rhel7:v2</span>

oc new-app hello/rhel7:v2 --name=myapp

oc expose svc/myapp
oc get svc/myapp -o wide

oc get routes
myapp-hello.apps.myopenshift.com

curl -v -k myapp-hello.apps.myopenshift.com
</pre>
</div>
</div>
</div>
</div>
