openshift_arch_oper.html

<div id="outline-container-org92bbc89" class="outline-2">
<h2 id="org92bbc89"><span class="section-number-2">3</span> Re-deploy the application</h2>
<div class="outline-text-2" id="text-3">
<p>
Create new image:
</p>
<div class="org-src-container">
<pre class="src src-sh">docker run -it --rm rhel7:v1
sh-4.2# yum install net-tools.x86_64 -y
sh-4.2# ifconfig eth0
sh-4.2# ifconfig eth0 | sed -n <span style="color: #2d9574;">'s/^[[:space:]]*inet \(.*\)  netmask.*/\1/p'</span>


</pre>
</div>

<p>
Push the new image to docker-registry:
</p>
<pre class="example">
# oc login -u system -p admin

# docker commit 2b8553a3eecc rhel7:v3
sha256:72f98ecf35e5b9ee116dc157d44959cc17f1ace8a6b2ad2cf074a784f2154ea3

# docker tag rhel7:v3 172.30.151.202:5000/hello/rhel7:v3
# docker login -p `oc whoami -t` -u system 172.30.151.202:5000
# docker push 172.30.151.202:5000/hello/rhel7:v3
The push refers to a repository [172.30.151.202:5000/hello/rhel7]
04a942261f21: Pushed
4ae10724cbf6: Layer already exists
d02565babdb9: Layer already exists
49577de67301: Layer already exists
v3: digest: sha256:bfbe84b4d8fa134cef339e5c690243d9d32345ad49742646cabcdebdc4d33176 size: 1163

</pre>

<p>
Build new image again:
</p>
<pre class="example">
[root@master test]# cat ncat-web.sh
#!/bin/sh
ip=`ifconfig eth0 | sed -n 's/^[[:space:]]*inet \(.*\)  netmask.*/\1/p'`
sed -i "s/_IP_/$ip/g" /index.http
while true; do nc -4l 8080 -c "cat /index.http"; done

[root@master test]# cat Dockerfile
# This Dockerfile uses the rhel7 image
# Ahthor: Cun Gong
FROM rhel7:v3
COPY ./index.http /index.http
COPY ./ncat-web.sh /ncat-web.sh
RUN chmod 755 ncat-web.sh
EXPOSE 8080
ENTRYPOINT ["/ncat-web.sh"]


[root@master test]# docker build -t rhel7:v4 .

# docker tag rhel7:v4 172.30.151.202:5000/hello/rhel7:v4
# docker login -p `oc whoami -t` -u system 172.30.151.202:5000
# docker push 172.30.151.202:5000/hello/rhel7:v4
</pre>

<p>
Delete &amp; re-create new app:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Delete app</span>
oc delete all --selector <span style="color: #7590db;">app</span>=myapp

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Create app</span>
oc new-app hello/rhel7:v4 --name=myapp

oc expose svc/myapp
oc get svc/myapp -o wide

oc get routes
myapp-hello.apps.myopenshift.com

curl -v -k myapp-hello.apps.myopenshift.com
</pre>
</div>

<p>
Scaling up the application:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Get all resource objects</span>
oc get all -o name --selector <span style="color: #7590db;">app</span>=myapp -o wide

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Scaleup deploymentconfig</span>
oc get dc
oc scale --replicas=<span style="color: #a45bad;">4</span> dc/myapp
oc get dc

oc get pods -o wide
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">NAME            READY     STATUS    RESTARTS   AGE       IP           NODE                    NOMINATED NODE</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">myapp-1-4p4qf   1/1       Running   0          53s       10.131.0.2   node3.myopenshift.com   &lt;none&gt;</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">myapp-1-7ds2f   1/1       Running   0          53s       10.129.2.2   node4.myopenshift.com   &lt;none&gt;</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">myapp-1-7px65   1/1       Running   0          53s       10.128.2.3   node2.myopenshift.com   &lt;none&gt;</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">myapp-1-rbgwd   1/1       Running   0          6m        10.130.0.4   node.myopenshift.com    &lt;none&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org388d569" class="outline-2">
<h2 id="org388d569"><span class="section-number-2">4</span> Getting traffic into a cluster</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org51b6366" class="outline-3">
<h3 id="org51b6366"><span class="section-number-3">4.1</span> Allow user with cluster admin role</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh">oc login -u system:admin -n hello
oc adm policy add-cluster-role-to-user cluster-admin system
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4c2bf9" class="outline-3">
<h3 id="orgd4c2bf9"><span class="section-number-3">4.2</span> Defining the public IP range</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">oc login -u system -p admin
oc project hello


</pre>
</div>

<p>
Configure the <b>externalIPNetworkCIDRs</b> parameter in the
<code>/etc/origin/master/master-config.yaml</code> file as shown (default is <b>0.0.0.0/0</b>):
</p>

<pre class="example">
networkConfig:
  externalIPNetworkCIDRs:
  - &lt;ip_address&gt;/&lt;cidr&gt;

</pre>

<p>
Restart the OpenShift Container Platform master service to apply the changes.
</p>
<div class="org-src-container">
<pre class="src src-sh">master-restart api
master-restart controllers
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7a8143" class="outline-3">
<h3 id="orgb7a8143"><span class="section-number-3">4.3</span> Create a Project and Service</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh">docker build -t rhel7:v5 .
docker tag rhel7:v5 <span style="color: #a45bad;">172.30.151.202:5000/hello/rhel7:v5</span>
docker login -p <span style="color: #fa8072;">`oc whoami -t`</span> -u system <span style="color: #a45bad;">172.30.151.202:5000</span>
docker push <span style="color: #a45bad;">172.30.151.202:5000/hello/rhel7:v5</span>
oc new-app hello/rhel7:v5 --name=myecho
oc get svc
ncat &lt;cluster-ip&gt; <span style="color: #a45bad;">8080</span>

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Expose the service to crete route</span>
oc expose svc/myecho
oc get svc
nc myecho-hello.apps.myopenshift.com <span style="color: #a45bad;">8080</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">failed: Ncat: No route to host.</span>

<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">Assigning an IP Address (infra. node ip) to the Service</span>
oc patch svc myecho -p <span style="color: #2d9574;">'{"spec":{"externalIPs":["192.168.23.52"]}}'</span>
oc get svc
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">NAME      TYPE        CLUSTER-IP       EXTERNAL-IP     PORT(S)    AGE</span>
<span style="color: #ffd700; background-color: nil;"># </span><span style="color: #ffd700; background-color: nil;">myecho    ClusterIP   172.30.51.131    192.168.23.52   8080/TCP   6m</span>

nc <span style="color: #a45bad;">192.168.23.52</span> <span style="color: #a45bad;">8080</span>
oc scale --replicas=<span style="color: #a45bad;">4</span> dc/myecho
oc get dc
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 龔存</p>
<p class="date">Created: 2020-02-20 周四 22:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
